logo = '''
__________                    .___                               
\______   \_____    ____    __| _/   ____ _____    _____   ____  
 |    |  _/\__  \  /    \  / __ |   /    \\__  \  /     \_/ __ \ 
 |    |   \ / __ \|   |  \/ /_/ |  |   |  \/ __ \|  Y Y  \  ___/ 
 |______  /(____  /___|  /\____ |  |___|  (____  /__|_|  /\___  >
        \/      \/     \/      \/       \/     \/      \/     \/ '''

print(logo)
pants_color = input('지금 입은 하의 색깔은 무엇입니까? >>> ')
last_food = input('마지막으로 먹은 음식은 무엇입니까? >>> ')
print(f'당신의 밴드 이름은 {pants_color} {last_food}입니다.')


